## 🏗️ [OpenTofu plan](https://opentofu.org)

Changes were detected in the OpenTofu plan. Please review the changes below.

<details>
<summary>
<code>make opentofu-plan</code>
</summary>

```tf

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # module.talos_cluster["lab01"].random_id.this will be created
  + resource "random_id" "this" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.talos_cluster["lab01"].talos_machine_secrets.this will be created
  + resource "talos_machine_secrets" "this" {
      + client_configuration = (known after apply)
      + id                   = (known after apply)
      + machine_secrets      = (known after apply)
      + talos_version        = "v1.9.3"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: opentofu.tfplan

To perform exactly these actions, run the following command to apply:
    tofu apply "opentofu.tfplan"
```

</details>